Repository: BitShares/bitshares.org
Catalog: translations/Thai(ไทย)/home_*.po
Languages: th

source: BitShares 2.0 - Industrial-grade decentralized (DPoS) eco-system on blockchain
th: BitShares 2.0 - รูปแบบการกระจายอำนาจระดับอุตสาหกรรม (DPos) มาตรตราฐานระดับสูง บน Blockchain

source: Decentralized Autonomous Cooperation (DAC)
th: ความร่วมมือการกระจายอำนาจที่ไม่ขึ้นกับส่วนกลาง (DAC)

source: BitShares Blockchain implements an industrial-grade technology focused on businesses, organizations or individuals, with an amazing eco-system and free-market economy. Based on open-source MIT-licensed Graphene technology, BitShares was launched in its existing form on 13th October 2015, known prior to that as a community project: 'ProtoShares'. Ever since then, the BitShares blockchain and its dApps have been maintained and developed by workers elected via stakeholder consensus, consisting of more than 30 highly skilled professionals.
th: BitShares บนนวัตกรรม Blockchain ในเทคโนโลยีมาตรฐานอุตสาหกรรม ระดับองค์กร หรือ บุคคล, ด้วยเทคโนโลยี eco-system และ ระบบเศรษฐกิจแบบตลาดเสรี บนพื้นฐานของซอฟต์แวร์ที่เปิดเผยต่อสาธารณชน (open-source) มาตราฐานของ MIT-licensed Graphene technology, BitShares ได้ถือกำเนิด เมื่อ 13 ตุลาคม 2558, ในรูปแบบของ การรวมตัวกันพัฒนาโครงการ นาม ‘ProtoShares’ นั้นคือจุดเริ่มต้นนับแต่นั้นมา, Bitshares บนเทคโนโลยี Blockchain นั้นใช้ระบบ dApps ที่ถูกบริหารจัดการและพัฒนาโดย บุคคลที่ได้รับการคัดเลือกจากการลงมติของผู้ก่อตั้ง, ซึ่งประกอบไปด้วยผู้เชี่ยวชาญที่มีทักษะสูงมากกว่า 30 คน.

source: DPoS Consensus
th: DPoS ฉันทามติ

source: The DPOS algorithm is divided into two parts: electing a group of block producers and scheduling production.
th: DPOS อัลกอริทึมจะแบ่งออกเป็นสองส่วนคือ ลงคะแนนเสียงเลือกกลุ่มผู้ผลิตบล็อก และ การจัดการเวลาของการผลิต.

source: The election process makes sure that stakeholders are ultimately in control because stakeholders lose the most when the network does not operate smoothly”. <em>Dan Larimer</em></p> <p>DPoS (Delegated Proof of Stake) specifically replaces environmentally reckless ‘mining’.
th: ‘กระบวนการเลือกตั้งจะสร้างความมั่นใจได้ว่า stakeholders จะไม่ถูกควบคุม เพราะการสูญเสีย ของการทำงานที่ไม่เสถียรของเครื่อข่าย’. <em>Dan Larimer</em></p> <p>DPoS (หลักฐานแสดงการเป็นผู้รับอำนาจ) เอกลักษณ์เฉพาะที่จะมาทดแทน ‘การขุด’.

source: Permissions
th: สิทธิ์การเข้าถึง

source: The BitShares Blockchain designs permissions around accounts and then cryptography for ease of use
th: BitShares Blockchain ออกแบบ สิทธิ์การเข้าถึงบัญชีผู้ใช้ และทำการเข้ารหัสความปลอดภัย เพื่อสะดวกในการนำไปใช้งาน

source: Every account can be controlled by single or weighted combinations of other account/s and/or keys. This creates a hierarchical structure which can be built to reflect real-life permissions – for example a company or organization approval and signing processes in digital form.
th: ทุกบัญชีผู้ใช้สามารถควมคุมผ่าน บุคคลเดียว หรือ หลายบุคคล หรือ รวมกับบัญชีผู้ใช้อื่นได้ ซึ่งจะสร้างโครงสร้างแบบลำดับชั้น สามารถสร้างขึ้นเพื่อ สะท้อนถึงสิทธิ์ในชีวิตจริง เช่น การอนุมัติและลงนามของบริษัทหรือองค์กร ในรูปแบบดิจิทัล.

source: Transactions
th: การทำธุรกรรม

source: Any user interacting with a Blockchain does so with transactions which are authentic and authorized.
th: บัญชีผู้ใช้ใดๆ ที่โต้ตอบกับ Blockchain เพื่อทำธุรกรรมที่เป็นของแท้และได้รับอนุญาต.

source: Transactions are constructed then transmitted to the network, containing instructions the user wants to perform. The most simple form is the transfer operation, which contains sender, receiver, amount, and optionally, encrypted memo.
th: การสร้างธุรกรรมแล้วส่งไปยังเครือข่าย, เป็นรูปแบบตามที่ผู้ใช้ต้องการ รูปแบบที่ง่ายที่สุด, คือการถ่ายโอนข้อมูล ซึ่งมีผู้ส่ง, ผู้รับ, จำนวน, และบันทึกข้อมูลเข้าเป็นรหัสลับ.

source: Token Factory
th: อุตสาหกรรม Token

source: Create your own cryptocurrency tokens by publically representing and listing a User-Issued Asset on the blockchain
th: สร้างสกุลเงินดิจิทอลของคุณเองได้ ด้วยความโปร่งใส อีกทั้ง ทุกรายการสินทรัพย์ของบัญชีผู้ใช้ เผยแพร่ต่อสาธารณชน ใน Blockchain

source: User-Issued Assets enable entrepreneurs to issue their own tokens. Event tickets, company shares, crowd-funding, loyalty/credits are just a few of the examples. Whitelist to create fully regulatory compliant KYC/AML tokens. Publically describe, list, and provide liquidity for your assets.
th: รายการสินทรัพย์สามารถเปลี่ยนเป็น tokens ของตนเองได้ หรือแม้กระทั่งเปลี่ยนเป็น ตั๋ว, หุ้นของ บริษัท, การระดมทุน, การตอบแทน สิ่งเหล่านี้เป็นเพียงตัวอย่างบางส่วนเท่านั้น KYC / AML ได้รับอนุญาตในการสร้าง tokens อย่างถูกต้อง พร้อมทั้งมีการกำกับดูแลอย่างเต็มที่ ทุกข้อมูล โปร่งใส เปิดเผยทุกธุรกรรมต่อสาธารณะ เพื่อเสริมสภาพคล่องสำหรับสินทรัพย์ของคุณ.

source: Extensibility
th: การขยายตัว

source: Operations on the BitShares Blockchain allow for extending its range of functions towards built-in or external dApps.
th: การดำเนินการใน BitShares Blockchain เปิดให้สามารถขยาย ความต้องการใหม่ของฟังก์ชัน ที่อยู่ใน dApps ทั้งแบบภายใน หรือ แบบภายนอกได้.

source: The BitShares Blockchain is extensively modularized and implements operations independently of one another. BitShares is considered so stable because core blockchain modifications require vetting by the core developer team, followed and approved by BTS holders before any network-wide protocol upgrade.
th: BitShares Blockchain เป็นโมดูลที่แยกเป็นส่วน ๆ และใช้งานได้อย่างอิสระ BitShares จึงว่าเป็นระบบที่มีความเสถียรอย่างมาก เพราะเมื่อ core หลักของ blockchain มีการเปลี่ยนแปลงจะต้องรับการตรวจสอบโดยทีมผู้พัฒนาหลัก ต้องเปิดเผย และผ่านการอนุมัติ โดยผู้ถือ BTS ก่อนการอัปเกรด โปรโตคอล ทั่วทั้งเครือข่าย.

source: Identity
th: เอกลักษณ์

source: Human-readable account names that must be registered together with public-keys in the blockchain prior to usage
th: ชื่อบัญชีผู้ใช้ที่มนุษย์สามารถอ่านได้ ต้องลงทะเบียนร่วมกับ public-keys ใน blockchain ก่อนจะถูกนำมาใช้

source: The BitShares Blockchain acts as a name-to-public-key resolver in a similar way to the traditional Domain Name Service (DNS). Users can easily remember and pass on their account information instead of error-prone addresses.
th: BitShares Blockchain ทำหน้าที่ name-to-public-key เป็นผู้จำแนกในการเข้าถึง Domain Name Service (DNS). ทำให้ง่ายสำหรับผู้ใช้ที่จะจดจำ และส่งต่อข้อมูลบัญชีของตน โดยปราศจากข้อผิดพลาด.

source: More Features of the BitShares industrial grade blockchain:
th: หลากหลายฟีเจอร์สำหรับ BitShares มาตรตราฐานระดับสูงของ blockchain:

source: Processing Speed
th: ความเร็วในทำงาน

source: Fastest block confirmations. Transactions get written to the blockchain within 3 seconds, and on average in under 1.5 seconds.
th: สุดยอดความเร็วในการตอบรับยืนยัน ทุกการทำธุรกรรมที่บันทึกเข้าสู่ blockchain ใช้เวลาสูงสุด 3 วินาที ซึ่งเฉลี่ยเวลาเพียง 1.5 วินาทีเท่านั้น.

source: Lowest Fees
th: ค่าธรรมเนียมต่ำ

source: Like other Blockchains, BitShares also has fees yet they are much lower than average, with 80% vesting cashback for lifetime members.
th: เมื่อเปรียบเทียบกับ Blockchains อื่นๆแล้วนั้น BitShares ยังมีค่าธรรมเนียมที่ต่ำกว่า ค่าเฉลี่ยค่าธรรมเนียมของทุกเจ้า อีกทั้งยังมีการ ทยอยให้หุ้นตามเวลา 80% แก่สมาชิกประเภทตลอดชีพ.

source: Recurring and Scheduled Payments
th: กำหนดและวางแผนการชำระเงินได้

source: Supports recurring payments, subscription payments, allow users to authorize third parties to make withdrawals within certain limits.
th: สนับสนุนการชำระเงินแบบอัตโนมัติ หรือที่เรียกว่า recurring payments, สนับสนุนการชำระแบบ ค่าสมัครรับบริการ, อีกทั้งผู้ใช้อนุญาตให้บุคคลที่สาม ถอนเงินภายในขอบเขตที่กำหนดได้.

source: Dynamic Account Permissions
th: สิทธิ์การเข้าถึงบัญชีแบบ Dynamic

source: Enabling management for the corporate environment, control wallets using a weighted combination of other account approvals.
th: สามารถบริหารจัดการ ควบคุม ภายใน wellets อย่างสมบรูณ์แบบ โดยผ่านการอนุมัติจากบัญชีผู้ใช้อื่น.

source: Self-Sustaining
th: ระบบพึ่งพาตนเอง

source: Powered by an eco-system of dApps which self-fund the core token BTS, ensuring the blockchain covers costs to keep going in perpetuity.
th: ขับเคลื่อนระบบ eco-system ของ dApps โดย กองทุนของตนเอง core หลัก BTS, เพื่อความ มั่นใจว่า blockchain จะมีการพัฒนาและเติบโตอย่างต่อเนื่อง.

source: Security
th: ความปลอดภัย

source: Delegated Proof of Stake (DPOS) is virtually impossible to hack, as it would involve taking out many active and backup, global, trusted delegates.
th: Delegated Proof of Stake (DPOS) ลงความเห็นเพื่อพิสูจน์การทำธุรกรรม ระบบที่สามารถปิดกั้นการ hack ได้อย่างสมบรูณ์ จากการลงความเห็นที่โปร่งใส และเชื่อถือได้.

source: Blockchain Activity Matrix
th: ตารางสถานะ Blockchain

source: Activity
th: สถานะ

source: Value
th: ค่า

source: Index
th: ลำดับ

source: Visit Blocktivity.info for more information and analysis.
th: อ่านข้อมูลเพิ่มเติม Blocktivity.info.

source: Press & Community News
th: ข่าวสารและสิ่งที่สนใจ

source: The latest and best stories about BitShares curated from around the web.
th: ข่าวสารความเคลื่อนไหวล่าสุดของ BitShares จากรอบโลก.

source: Join the World’s Fastest Industrial Grade Blockchain Platform and Eco-System!
th: ร่วมเป็นส่วนหนึ่ง ของมาตราฐานระดับสูง Blockchain และ Eco-system กับความเร็วเหนือชั้นที่สุดในโลก.

source: Become Basic Member
th: เข้าร่วมเป็นสมาชิก
