Repository: BitShares/bitshares.org
Catalog: translations/Thai(ไทย)/tech3_*.po
Languages: th

source: Dynamic Account Permissions
th: สิทธิ์การเข้าถึงบัญชี แบบไดนามิก

source: Management for the corporate environment
th: การบริหารจัดการ สิ่งแวดล้อมขององค์กร

source: Price:
th: ราคา:

source: Market Cap:
th: มูลค่าตลาด:

source: Volume (24h):
th: ปริมาณ (24ชม.):

source: BitShares designs permissions around people rather than cryptography, making it easy to use. Every account can be controlled by any weighted combination of other account signatures and private keys. This creates a hierarchical structure that reflects how permissions are organized in real life, and makes multi-user control over account authority easier than ever. Multi-user control is the single biggest contributor to security, and, when used properly, it can virtually eliminate the risk of theft due to hacking.
th: BitShares ออกแบบสิทธิ์การเข้าถึงบัญชีสำหรับทุกคน มากกว่าแค่การเข้ารหัสป้องกัน, ทำการออกแบบให้ง่ายต่อการใช้ บัญชีทุกบัญชีสามารถควบคุมได้ โดยการวัดความสำคัญร่วมกับบัญชีอื่น ๆ และคีย์ส่วนตัว สิ่งนี้จะสร้างโครงสร้างตามแบบลำดับชั้น ซึ่งสะท้อนถึงการจัดเตรียมสิทธิ์ในชีวิตจริง และทำให้ผู้ใช้หลายคนสามารถควบคุมการเงินได้ง่ายขึ้นกว่าที่เคย การควบคุมผู้ใช้หลายคน เป็นการให้ความสำคัญสูงสุดด้านความปลอดภัย, และเมื่อทำการอย่างถูกต้อง ก็จะสามารถลดความเสี่ยงของการถูกโจรกรรมเนื่องจากการแฮ็กได้.

source: Background
th: เบื้องหลัง

source: The ability to require multiple digital signatures for sensitive operations on the blockchain is integral to the security of the platform. While a single secret key may be compromised, multiple keys distributed over multiple locations adds redundant protections, providing a far more secure experience.
th: ความสามารถในการกำหนดลายเซ็นดิจิทัลที่หลากหลายแบบ เพื่อการตรวจสอบที่ละเอียดอ่อนบน blockchain เป็นส่วนสำคัญต่อความปลอดภัยของแพลตฟอร์ม ขณะที่ single key อาจมีโอกาสถูกบุกรุก, แต่ multiple keys ที่กระจายไปทั่ว blockchain ช่วยเพิ่มความคุ้มครองที่ซ้ำซ้อนยากต่อการบุกรุก ซึ่งส่งผลให้เกิดความปลอดภัยยิ่งขึ้น.

source: Competing blockchain systems suffer from the following shortcomings:
th: การแข่งขันในระบบ blockchain จะได้รับความเสียหายจากข้อบกพร่อง ดังต่อไปนี้:

source: The M-of-N model cannot sufficiently reflect the management hierarchies of many real-life organizations.
th: โมเดล M-of-N ไม่สามารถสะท้อนถึงการจัดการลำดับชั้นภายในองค์กรเหมือนในชีวิตจริง.

source: Equal weighting of M keys is not sufficient to express asymmetric ownership over an account.
th: การชั่งน้ำหนักความสำคัญของคีย์ M ไม่เพียงพอที่จะแสดงถึงการเป็นเจ้าของบัญชีนั้นๆ.

source: Coordination and signing must be done completely out-of-band.
th: การประสานงานและการลงนามต้องทำอย่างสมบูรณ์แบบ out-of-band.

source: Keys cannot be changed without coordination of all other parties.
th: ไม่สามารถเปลี่ยนแปลง key โดยลำพังไม่ต้องประสานงานกับฝ่ายอื่นๆ ทั้งหมด.

source: Signatures cannot be retracted while waiting on other parties.
th: ไม่สามารถถอนยกเลิกลายเซ็น ในขณะที่รอให้ฝ่ายอื่นๆ ตรวจสอบ.

source: Use Case
th: กรณีต่างๆ ที่เกิดขึ้นภายในระบบ

source: Multi-signature technology is all about permission management, and permissions should be defined in terms of people or organizations rather than keys.
th: เทคโนโลยีหลายลายเซ็น นั้นเกี่ยวกับการจัดการสิทธิ์ และควรกำหนดสิทธิ์ในรูปแบบของบุคคลหรือองค์กรมากกว่า key.

source: Consider an example company that is run by 3 individuals: Alice, Bob, and Carol.
th: ลองพิจารณาตัวอย่าง บริษัท ที่บริหารโดยบุคคล 3 คน ได้แก่ Alice, Bob และ Carol.

source: Alice and Bob each own 40% of the company and Carol owns 20%.
th: Alice และ Bob แต่ละคนเป็นเจ้าของ 40% ของ บริษัท และ Carol เป็นเจ้าของ 20%.

source: This company requires 2 of the 3 principles to approve all expenses.
th: บริษัท นี้ต้องการ 2 ใน 3 หลักการในการอนุมัติค่าใช้จ่ายทั้งหมด.

source: You could define the company in terms of keys assigned to Alice, Bob, and Carol, but what if Alice wants to protect her own identity with a multi-signature check? Alice opts to use a service provider that performs 2-factor authentication on every action Alice makes. This protects both Alice and the company, which does not need to change its permission structure to accommodate the choice of 2-factor authentication.
th: คุณสามารถกำหนด บริษัท ในแง่ของกุญแจที่กำหนดให้กับ Alice, Bob และ Carol แต่ถ้าหาก Alice ต้องการปกป้องเธอ ตัวตนของคุณเอง ด้วยการตรวจสอบ multi-signature? Alice เลือกที่จะใช้ผู้ให้บริการที่ดำเนินการตรวจสอบสิทธิ์แบบ 2 ปัจจัยในทุกการกระทำของAlice สิ่งนี้ปกป้องทั้งAlice และบริษัท ซึ่งไม่จำเป็นต้องเปลี่ยนโครงสร้างการอนุญาต เพื่อรองรับตัวเลือกการตรวจสอบสิทธิ์แบบ 2 ปัจจัย.

source: Solution
th: การแก้ปัญหา

source: BitShares introduced a new approach to permissions based upon accounts which are assigned globally unique IDs.
th: BitShares นำเสนอแนวทางใหม่ ในการให้สิทธิ์การเข้าถึงบัญชีที่มี โดยมอบ IDs ที่จะไม่ซ้ำกันซึ่งมีเพียงชุดเดียวในโลก.

source: Under this system, it is possible to define an account that has no keys itself, but instead depends solely upon the approval of other accounts. Those other accounts can, in turn, depend upon the approval of other accounts. This process forms a <em>hierarchy</em> of accounts that must grant permission. Each account can change its own permissions independently of any accounts above it in the hierarchy, which is what makes the permissions <em>dynamic</em>.
th: ภายใต้ระบบนี้คุณสามารถกำหนดบัญชีที่ไม่มีคีย์เองได้ แต่ยังขึ้นอยู่กับการอนุมัติจากบัญชีอื่นๆ ในทางกลับกันบัญชีอื่นๆ จะขึ้นอยู่กับการอนุมัติบัญชีถนัดไปเช่นกัน กระบวนการนี้สร้างลำดับชั้นของบัญชีที่ต้องตรวจสอบซึ่งกันและกันในการอนุมัติ แต่ละบัญชีสามารถเปลี่ยนสิทธิ์ของตนเองได้โดยอิสระจากบัญชีใดๆ ที่อยู่ในลำดับบนจากบัญชีตน ซึ่งเป็นสิ่งที่สามารถทำได้ ในการเข้าถึงแบบ ไดนามิก.

source: The second solution is to include the partially signed transaction in the consensus state and allow accounts to publish transactions that add or remove their approval of the transaction. This simplifies the signing coordination problem, enables people to change their mind before the threshold is reached, and applies the transaction immediately upon receipt of the final approval.
th: ทางออกที่สอง คือ การรวมธุรกรรมบางส่วนลงนามในสถานะที่เป็นเอกฉันท์ และอนุญาตให้บัญชีเผยแพร่ธุรกรรม ที่เพิ่มหรือลบการอนุมัติธุรกรรมดังกล่าว ทางออกนี้ช่วยลดปัญหาการลงนาม, ช่วยให้สามารถเปลี่ยนใจเปลี่ยนความคิดก่อนถึงเวลาที่กำหนดได้, และใช้บันทึกรายการทันทีที่ได้รับการอนุมัติขั้นสุดท้าย.

source: The process for executing a transaction that requires multi-signature authority is as follows:
th: กระบวนการสำหรับ การทำธุรกรรมที่ต้องใช้สิทธิ์จาก multi-signature มีดังนี้:

source: Someone proposes a transaction and approves it with their account.
th: มีคนเสนอธุรกรรมและอนุมัติบัญชีดังกล่าวด้วยบัญชีของตน.

source: Other account holders broadcast transactions, adding their “Yes” or “No” to the proposal.
th: ผู้ถือบัญชี ที่ออกประกาศรายการ สามารถเพิ่มตัวเลือก “ใช่” หรือ “ไม่” ในข้อเสนอได้.

source: When the proposed transaction has the approval of all accounts, it is confirmed.
th: เมื่อรายการได้รับการอนุมัติจากบัญชีทั้งหมดแล้ว จึงจะได้รับการยืนยัน.

source: Owner and Active Keys
th: ความเป็นเจ้าของ และ Active Keys

source: Every account is assigned <em>two</em> authorities: owner and active.
th: ทุกบัญชีจะได้สิทธิ์อยู่ทั้งหมด 2 สิทธิ์ คือ สิทธิ์ความเป็นเจ้าของ และ สิทธิ์ในการอนุมัติ.

source: An <em>authority</em> is a set of keys and/or accounts, each of which is assigned a weight.
th: สิทธิ์ของชุดของคีย์ และ/หรือ บัญชี ซึ่งแต่ละอันมีการกำหนดความสำคัญเอาไว้.

source: Each <em>authority</em> has a weight threshold that must be crossed before an action requiring that <em>authority</em> may be performed.
th: แต่ละสิทธิมีระดับความสำคัญที่ต้องผ่านการอนุมัติ ก่อนการดำเนินการที่ต้องใช้สิทธิดังกล่าว.

source: The <em>owner authority</em> is designed for cold-storage, and its primary role is to update the <em>active authority</em> or to change the <em>owner authority</em>.
th: สิทธิ์ความเป็นเจ้าของ ได้รับการออกแบบมาสำหรับ cold-storage และบทบาทหลัก คือ การอัปเดต อนุมัติสิทธิ์ใช้งาน หรือ เปลี่ยนสิทธิ์ความเป็นเจ้าของ.

source: The <em>active authority</em> is meant to be a hot key and can perform any action except changing the <em>owner authority</em>.
th: สิทธิ์ในการอนุมัติ หมายถึง hot key และสามารถที่จะดำเนินการใด ๆ ได้ยกเว้นการเปลี่ยนแปลงสิทธิ์ความเป็นเจ้าของ.

source: The motivating use case is a 2-factor authentication provider as a co-signer on the <em>active authority</em>, but not on the <em>owner authority</em>.
th: กรณีใช้ในการชักจูง แบบ 2-factor authentication ผู้ให้บริการ เป็น ผู้ลงนามร่วมใน สิทธิ์ในการอนุมัติ แต่ไม่ได้อยู่ใน สิทธิ์ความเป็นเจ้าของ.

source: With this approach, a user can remain confident that their account will always be in their control, and yet that control can be kept in cold storage where no one can hack it. This means that a company account can require the approval of its board of directors and each board member may in turn require 2 factor authentication.
th: ด้วยวิธีนี้ผู้ใช้สามารถมั่นใจได้ว่าบัญชีของตน จะอยู่ในการควบคุมเสมอ และยังถูกเก็บไว้ใน cold storage ซึ่งไม่มีใครสามารถแฮ็กได้ ซึ่งหมายความว่าบัญชีบริษัท จะต้องได้รับการอนุมัติจากคณะกรรมการบริษัททั้งหมด และสมาชิกในคณะกรรมการบริษัทแต่ละราย จะต้องได้รับการการตรวจสอบ แบบ 2 factor authentication.

source: Anyone can rotate keys frequently without having to disturb the permissions on the accounts of its users.
th: ทุกคนสามารถสลับสับเปลี่ยนคีย์ได้บ่อยๆ โดยไม่ต้องรบกวนสิทธิ์การเข้าถึงในบัญชีของผู้ใช้.

source: Gathering Signatures
th: การรวบรวมลายเซ็น

source: One of the challenges that has made multi-signature approaches difficult to use in the past was the act of gathering required signatures was entirely manual, or required specialized infrastructure. Once a transaction is signed, there is no ability to retract your signature, so the last party to sign gains a slight advantage over the other parties. With deeper hierarchies, gathering signatures becomes even more complex.
th: หนึ่งในการความท้าทายที่ทำให้การทำงานของ multi-signature เป็นวิธีการทำงานที่เกิดขึ้นได้ยากในอดีต การรวบรวมลายเซ็นจึงต้องทำกันแบบแมนนวล หรือโครงสร้างพื้นฐานที่จำเป็น เมื่อมีการเซ็นธุรกรรม ไม่สามารถที่จะลบหรือถอนลายเซ็นที่ทำธุรกรรมได้ ดังนั้นฝ่ายสุดท้ายที่จะลงนามธุรกรรมจะได้รับประโยชน์เล็กน้อยจากทุกฝ่าย เมื่อมีลำดับชั้นที่ลึกลงไปจะทำให้รวบรวมลายเซ็นได้ยากยิ่งขึ้น.

source: To simplify this process, a blockchain should manage the signature gathering process by tracking the state of partially approved proposed transactions. Under this process, each account can add (or remove) their permission to a transaction atomically, without having to rely upon an outside system to circulate the transaction. This becomes especially critical for hierarchies that are arbitrarily deep.
th: เพื่อทำให้กระบวนการนี้ง่ายยิ่งขึ้น blockchain ได้เลือกการจัดการบริหารลายเซ็นโดย การติดตามสถานะของธุรกรรมที่เสนอบางส่วนที่ได้รับอนุมัติ ภายใต้กรรมวิธีนี้ แต่ละบัญชีสามารถ เพิ่ม หรือ ลบ ย้าย สิทธิต่างๆ ไปยังธุรกรรมได้โดยอัตโนมัติ โดยไม่ต้องพึ่งพาระบบภายนอกเพื่อหมุนเวียนธุรกรรม นี่เป็นสิ่งสำคัญอย่างยิ่งสำหรับลำดับชั้นที่มีความลึกและซับซ้อนยิ่งขึ้น.

source: In order to keep things computationally bounded, an individual transaction will only traverse down two layers in a hierarchy. If more than two layers of hierarchy are present, then an account will have to propose (create one transaction) to approve a proposal (the other transaction). When the first proposal (transaction) is approved, permission is then added to the second proposal (transaction).
th: เพื่อให้สิ่งต่าง ๆ ถูกจำกัดขอบเขต การทำธุรกรรมแต่ละรายการจะทำการสำรวจสองชั้นในลำดับชั้นเท่านั้น ถ้าเกินกว่าสองชั้นในลำดับชั้นที่มีอยู่ บัญชีจะต้องเสนอ (สร้างหนึ่งธุรกรรม) เพื่ออนุมัติข้อเสนอ (ธุรกรรมอื่น ๆ ) เมื่อข้อเสนอแรก (ธุรกรรม) ได้รับการอนุมัติจะมีการเพิ่มสิทธิ์ในข้อเสนอที่สอง (ธุรกรรม).

source: Under this approach, each individual pays a single transaction fee each time they approve an action, and every action involves at most 1 signature verification by the network. This process allows arbitrarily deep hierarchies to be formed without exposing the permission system to vulnerability of unbounded computation.
th: ภายใต้วิธีนี้ แต่ละคนจ่ายค่าธรรมเนียมการทำธุรกรรมครั้งเดียวทุกครั้งที่พวกเขาอนุมัติการกระทำ และทุกการกระทำเกี่ยวข้องกับการตรวจสอบลายเซ็นสูงสุด 1 ครั้งโดยเครือข่าย กระบวนการนี้อนุญาตให้มีการจัด ลำดับชั้นแบบลึก ได้เลยโดยไม่ต้องการประกาศอนุญาตจากระบบจัดการสิทธิ ตัดความเสี่ยงของการคำนวณไป.

source: Scalability
th: ความยืดหยุ่น

source: In theory, accounts can form a hierarchy that is arbitrarily deep, and evaluating that hierarchy can take an arbitrary amount of time. In practice, it is unlikely that a single transaction will have signatures more than 2 levels deep, which keeps them computation bounded. Anything that requires more than 2 levels is likely to involve many people, and would not be signed all at once. Instead, it would use the built-in proposed transaction infrastructure, which tracks partially approved transactions.
th: ในทางทฤษฎี บัญชีสามารถสร้างลำดับชั้นที่ลึกลงไปได้และการประเมินว่าลำดับชั้นสามารถใช้ได้ทุกเวลา ในทางปฏิบัติแล้วนั้น เป็นไปได้ยากมากที่ธุรกรรมเดียวจะมีลายเซ็นมากกว่า 2 ระดับ ซึ่งทำให้การคำนวณนั้นมีขอบเขตที่จำกัด สิ่งใดก็ตามที่ต้องการมากกว่า 2 ระดับมีแนวโน้มที่จะเกี่ยวข้องกับคนจำนวนมาก และจะไม่ได้รับการลงนามทั้งหมดในครั้งเดียว โดยมันจะใช้การแสดงธุรกรรมพื้นฐานภายใน ซึ่งติดตามธุรกรรมที่ได้รับการอนุมัติบางส่วน.

source: With this approach, a board member can propose that his company approve a transaction.
th: ด้วยวิธีการนี้สมาชิกคณะกรรมการ สามารถเสนอให้บริษัทของเขา อนุมัติการทำธุรกรรม.

source: This can be extended logically to propose, and account propose, to approve a transaction.
th: สิ่งนี้สามารถขยายเหตุผลเพื่อเสนอขออนุมัติ และเสนออนุมัติบัญชี เพื่ออนุมัติการทำธุรกรรม.

source: This process would collect transaction fees as all of the layers in the hierarchy gradually add their permissions, and at no time requires an unbounded calculation.
th: กระบวนการนี้จะเก็บค่าธรรมเนียมการทำธุรกรรม เนื่องจากเลเยอร์ทั้งหมดในลำดับชั้นค่อยๆ เพิ่มสิทธิ์ของพวกเขา และในเวลาที่ไม่จำเป็นต้องมีการคำนวณมากนัก.

source: Cycles
th: วงจร

source: It is possible for two accounts to require each other to approve a transaction.
th: มีความเป็นไปได้ที่บัญชีสองบัญชีจะต้องอนุมัติธุรกรรมให้ซึ่งกันและกัน.

source: Imagine account X is created that requires A and Y to approve. Imagine account Y is created that requires B and X to approve. The graph looks like this:
th: ลองจินตนาการว่า บัญชี x เป็นผู้สร้าง คำสั่งไปยัง A และ Y ต้องอนุมัติ จิตนาการว่า บัญชี Y เป็นผู้สร้างคำสั่งไปยัง B และ x ต้องเป็นผู้อนุมัติ กราฟจะออกมาในลักษณะนี้:

source: A proposes that X spend 1 BTS and waits for approval from Y. B proposes that Y approve the proposal from A and waits for approval from X.
th: การเสนอที่ให้ X จะจ่าย 1 BTS และรอการอนุมัติจาก Y. B เสนอให้ Y อนุมัติรายการจาก A และรอการอนุมัติจาก X.

source: There is no way to resolve this problem with a single approval from any party due to the following reasons:
th: ไม่มีวิธีแก้ไขปัญหานี้ด้วยการอนุมัติเพียงครั้งเดียวจากฝ่ายใดฝ่ายหนึ่งเนื่องจากเหตุผลดังต่อไปนี้:

source: Cycles don’t have to be direct as in this case, they can involve arbitrarily long sequences and thus be non-obvious.
th: วงจรไม่จำเป็นต้องตรงกับกรณีนี้ ซึ่งสามารถเกี่ยวข้องกับ ลำดับ โดยไม่เจาะจง จึงทำให้ไม่ชัดเจน.

source: If users create an approval cycle in the <em>active authority</em> then the <em>owner authority</em> can be used to break the cycle. However, if they construct a cycle in the <em>owner authority</em> and the <em>active authority</em> then the accounts involved in the cycle would be locked out.
th: หากผู้ใช้สร้างวงจรการอนุมัติในหน่วยงานที่ใช้งานอยู่ สิทธิ์ในการเป็นเจ้าของจะถูกนำมาใช้เพื่อแยกวงจรการทำงานนั้น อย่างไรก็ตาม หากพวกเขาสร้างวงจรในอำนาจของเจ้าของ และผู้มีอำนาจที่ใช้งานแล้วบัญชีที่เกี่ยวข้องในวงจรนั้น จะถูกล็อคออก.

source: In practice client software can detect cycles and prevent them from being formed.
th: ในทางปฏิบัติซอฟต์แวร์ไคลเอ็นต์ สามารถตรวจจับวงจร และป้องกันไม่ให้เกิดขึ้น.

source: Conclusion
th: ข้อสรุป

source: Dynamic hierarchical threshold multi-signature permissions provides people and organizations with a more natural way to express ownership and control policies. This approach makes the system easier to use, and ultimately more secure than existing solutions.
th: การอนุญาตให้ใช้ลายเซ็นแบบหลายระดับ แบบไดนามิก นี้ช่วยให้ผู้คนและองค์กร ใกล้เคียงกับโลกความเป็นจริงสะดวก และง่ายในการแสดงความเป็นเจ้าของ และนโยบายการควบคุม ซึ่งวิธีนี้ทำให้ระบบใช้งานง่ายขึ้น และยังเป็นวิธีที่ปลอดภัยกว่าโซลูชันที่มีอยู่ในปัจจุบัน.

source: Credits
th: อ้างอิง

source: The Ripple wiki documents a <a href='https://developers.ripple.com/multi-signing.html' target='_blank'>similar Multisign feature</a>, which was discovered independently however was not implemented until more recently.
th: เอกสารจาก Ripple wiki แต่ยังไม่ได้ดำเนินการ <a href=‘https://developers.ripple.com/multi-signing.html' target=‘_blank’>ข้อเสนอสำหรับคุณสมบัติ Multisign</a> ที่คล้ายคลึงกัน ที่ถูกค้นพบ.
