Repository: BitShares/bitshares.org
Catalog: translations/Thai(ไทย)/tech5_*.po
Languages: th

source: Transferable Named Accounts
th: บัญชีที่สามารถเป็นชื่อได้

source: Easy and secure transactions
th: การทำธุรกรรมที่ง่ายและปลอดภัย

source: Price:
th: ราคา:

source: Market Cap:
th: มูลค่าตลาด:

source: Volume (24h):
th: ปริมาณ (24ชม.):

source: Named accounts allow you to easily remember and communicate your account information with security. We don't use IP addresses to browse the internet or numbers to identify our email, so why shouldn't we have human-friendly account names for our blockchain transactions?
th: บัญชีที่มีชื่อง่ายต่อการจดจำ และสื่อสารข้อมูลภายในบัญชีของพวกเขาได้อย่างง่ายดาย เราไม่ใช้ IP addresss เพื่อเข้าใช้งานอินเทอร์เน็ต หรือใช้หมายเลขเพื่อระบุตัวตนหรืออีเมลของเรา ดังนั้นทำไมเราจะไม่สามารถที่จะมีชื่อบัญชีที่ ง่ายต่อการจดจำ ง่ายสำหรับธุรกรรมทางการเงินของเรา?

source: Every BitShares blockchain account is assigned a globally unique name that can be selected by its creator. There are many uses for named accounts beyond security and simply being an alias to a set of <a href='../technology/dynamic-account-permissions' target='_blank'>dynamic account permissions</a>. They can be used as user logins or even mapped to your domain name. Named accounts are also transferable, which means a name can become valuable in its own right.
th: ทุกบัญชี BitShares ได้รับการกำหนดชื่อที่ไม่ซ้ำกันทั่วโลกที่ผู้สร้างสามารถเลือกได้ มีความเป็นไปได้มากมายที่จะใช้ชื่อบัญชี นอกเหนือจากการเป็นเพียงนามแฝง สำหรับสิทธิ์การเข้าถึง <a href=‘../technology/dynamic-account-permissions’ target=‘_blank’>บัญชีแบบไดนามิก</a> สามารถใช้เป็นชื่อล็อกอินของผู้ใช้ หรือ ใช้ร่วมกับชื่อโดเมน ชื่อเหล่านี้สามารถถ่ายโอนได้ ซึ่งหมายความว่า คุณมีสิทธิจะเลือกชื่อบัญชีของตนเองที่หลากหลาย.

source: BitShares blockchain defines a simple algorithm to determine the fee it charges to reserve a new account name. Names that contain a number or dash '-', are longer than 8 characters, or contain no vowels are essentially free. Otherwise the name is priced according to its length. BitShares has the power to adapt to market demands by allowing <a href='../technology/delegated-proof-of-stake-consensus' target='_blank'>delegates</a> to propose a different fee for each length.
th: BitShares blockchain กำหนดอัลกอริทึมอย่างง่าย เพื่อกำหนดค่าธรรมเนียมที่จะเรียกเก็บเพื่อจองชื่อบัญชีใหม่ ชื่อบัญชีจำเป็นต้องมีตัวเลข ผสมอยู่ด้วย และมีความยาวรวมแล้วมากกว่า 8 ตัวอักษร หรือไม่มีเสียงสระ มิฉะนั้นชื่อบัญชีนั้นๆจะมีราคาตามความยาวของมัน ผู้ใช้สามารถเสนอค่าธรรมเนียมที่แตกต่างกันสำหรับแต่ละความยาว ซึ่งทำให้ BitShares มีอำนาจใน<a href=‘../technology/delegated-proof-of-stake-consensus’ target=‘_blank’>การปรับ</a>ให้เข้ากับความต้องการของตลาด.

source: Transferring Names
th: การโอนย้ายชื่อ

source: When a BitShares blockchain user transfers an account name, they use a special transaction that clears all of the links in the web-of-trust. This protects both the buyer and the seller, because simply updating the key that controls a named account does not signify a legal change in ownership.
th: เมื่อผู้ใช้ถ่ายโอนชื่อบัญชีไปยังผู้ใช้รายอื่น พวกเขาจะใช้ธุรกรรมพิเศษที่สามารถล้างลิงก์ทั้งหมดใน web-of-trust ได้ ทั้งสองฝ่ายระหว่าง ผู้ซื้อและผู้ขาย สามารถป้องกันข้อมูลของตนเองได้ เพราะเพียงแค่อัปเดตรหัสที่ควบคุมบัญชี ที่มีชื่ออยู่นั้น ไม่ได้หมายถึงการเปลี่ยนแปลงการเป็นเจ้าของในบัญชี.
