Repository: BitShares/bitshares.org
Catalog: translations/Thai(ไทย)/tech1_*.po
Languages: th

source: Once this happens, BitUSD is effectively as good as USD with a small fixed conversion fee. This fee will likely be no more than the withdraw and deposit fees that current exchanges charge. At that point, BitShares will be a fully operational exchange with many banking partners providing high liquidity. A truly decentralized exchange will have been realized, and the original vision of BitShares completed.
th: เมื่อเกิดเหตุการณ์เช่นนี้ทิศทางมูลค่าของ BitUSD จะดีขึ้นตามมูลค่าของ USD ด้วยค่าธรรมเนียมการแปลงที่ต่ำ ค่าธรรมเนียมการแปลงนี้อาจจะไม่เกินค่าธรรมเนียมการเบิกจ่ายและการฝากที่เกิดจาก exchanges ณ จุดนั้น BitShares จะเป็นสกุลเงินที่สมบูรณ์แบบสามารถดำเนินการต่างๆ กับสถาบันการเงินจำนวนมากโดยไม่มีขีดจำกัด เงินฝากของผู้ใช้ จะปราศจากการสูญเสียที่จะเกิดขึ้นจาก exchange หรือ เกตเวย์ ซึ่งจะการแลกเปลี่ยนแบบกระจายอำนาจ(decentralized exchange)อย่างแท้จริง เป็นไปตามแบบแผนและวิสัยทัศน์ดั่งเดิมของ BitShares อย่างสมบูรณ์แบบ.
